Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/mozi__mozi-035-major-illustrations__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 天之愛人心，薄於聖人之愛人也；其利人也，厚於聖人之利人也。大人之愛小人也，薄於小人之愛大人也；其利小人也，厚於小人之利大人也。以臧為其親也而愛之，愛其親也；以臧為其親也而利之，非利其親也。以樂為利其子，而為其子欲之，愛其子也；以樂為利其子，而為其子求之，非求其子也。於所體之中，而權輕重之謂權。權非為是也，亦非為非也。權，正也。斷指以存腕，利之中取大，害之中取小也。害之中取小也，非取害也，取利也。其所取者，人之所執也。遇盜人，而斷指以免身，利也；其遇盜人，害也。斷指與斷腕，利於天下相若，無擇也。死生利若，非無擇也。殺一人以存天下，非殺一人以利天下也。殺己以存天下，是殺己以利天下。於事為之中，而權輕重之謂求。求，為之非也。害之中取小，求為義，非為義也。為暴人語天之為是也，而性，為暴人歌天之為非也。諸陳執既有所為，而我為之陳執，執之所為，因吾所為也；若陳執未有所為，而我為之陳執，陳執因吾所為也。暴人為我為天之以人非為是也，而性。不可正而正之。利之中取大，非不得已也；害之中取小，不得已也。所未有而取焉，是利之中取大也；於所既有而棄焉，是害之中取小也。義可厚，厚之；義可薄，薄之，謂倫列。德行、君上、老長、親戚，此皆所厚也。為長厚，不為幼薄。親厚，厚。親薄，薄。親至，薄不至。義，厚親不稱行而顧行。為天下厚禹，為禹厚也。為天下愛禹，乃為禹之愛人也。厚禹之加於天下，而厚禹不加於天下。若惡盜之為加於天下，而惡盜不加於天下。愛人不外己，己在所愛之中。己在所愛，愛加於己。倫列之愛己，愛人也。聖人惡疾病，不惡危難。正體不動，欲人之利也，非惡人之害也。聖人不為其室，臧之故，在於臧。聖人不得為子之事。聖人之法，死亡親，為天下也。厚親，分也，以死亡之，體渴興利。有厚薄而毋倫列，之興利為己。語經：語經也，非白馬焉，執駒焉說求之，無說非也。殺犬之無大，非也。三物必具，然後足以生。臧之愛己，非為愛己之人也。厚不外己。愛無厚薄，譽己，非賢也。義，利，不義，害。志功為辯。有友於秦馬，有友於馬，也智來者之馬也。愛眾世與愛寡世相若。兼愛之有相若。愛尚世與愛後世，一若今之世人也。鬼，非人也，兄之鬼，兄也。天下之利驩。聖人有愛而無利，俔日之言也，乃客之言也。天下無人，子墨子之言也。猶在。不得已而欲之，非欲之也，專殺臧。非殺臧也。專殺盜，非殺盜也。小圜之圜，與大圜之圜同。不至尺之不至也，與不至千里之不至不異，其不至同者，遠近之謂也。是璜也，是玉也。意楹，非意木也，意是楹之木也。意指之人也，非意人也。意獲也，乃意禽也。志功，不可以相從也。凡譽愛人，利人也，為其人也。富人，非為其人也。有為也以富人。富人也，治人有為鬼焉。為賞譽利一人，非為賞譽利人也。亦不至無賞譽於人。智親之一利，未為孝也，亦不至於智不為己之利於親也。智是世之有盜也，盡愛是世。智是室之有盜也，不盡惡是室也。智其一人之盜也，不盡是二人。雖其一人之盜，苟不智其所在，盡惡其朋也。諸聖人所先為，人效名實。實不必名。苟是石也白，敗是石也，盡與白同。是石也唯大，不與大同，是有使謂焉也。以形貌命者，必智是之某也，焉智某也。不可以形貌命者，唯不智是之某也，智某可也。諸以居運命者，苟入於其中者，皆是也，去之，因非也。諸以居運命者，若鄉里齊、荊者，皆是。諸以形貌命者，若山丘室廟者，皆是也。智與意異。重同，俱同，連同，同類之同，同名之同，同根之同，丘同，鮒同，是之同，然之同。有非之異，有不然之異。有其異也，為其同也，為其同也異。一曰乃是而然，二曰乃是而不然，三曰遷，四曰強。子深其深，淺其淺，益其益，尊其尊。察次由比因至，優指得，次察聲端名，因情得。匹夫辭惡者，人有以其請得焉。諸所遭執，而欲惡生者，人不必以其請得焉。聖人之拊瀆也，仁而無利愛，利愛生於慮。昔者之慮也，非今日之慮也；昔者之愛人也，非今之愛人也。愛獲之愛人也，生於慮獲之利，慮獲之利，非慮臧之利也，而愛臧之愛人也，乃愛獲之愛人也。去其愛而天下利，弗能去也。昔之知嗇，非今日之知嗇也。貴為天子，其利人不厚於匹夫。二子事親，或遇孰，或遇凶，其親也相若。非彼其行益也，非加也。外埶無能厚吾利者。藉臧也死而天下害，吾持養臧也萬倍，吾愛臧也不加厚。長人之與短人也同，其貌同者也，故同。指之人也與首之人也異。人之體，非一貌者也，故異。戕劍與挺劍異，劍以形貌命者也，其形不一，故異。楊木之木與桃木之木也，同。諸非以舉量數命者，取之盡是也。故一指，非一人也，一人之指，乃是一人也。方之一面，非方也，方木之面，方木也。夫辭以故生，以理長，以類行也者。立辭而不明於其所生，妄也。今人非道無所行，唯有強股肱，而不明於道，其困也，可立而待也。夫辭以類行者也，立辭而不明於其類，則必困矣。故浸淫之辭，其類在鼓栗。聖人也，為天下也，其類在于追迷。或壽或卒，其利天下也指若，其類在礜石。一日而百萬生，愛不加厚，其類在惡害。愛上世有厚薄，而愛上世相若，其類在蛇蚿。愛之相若，擇而殺其一人，其類在院下之鼠。小仁與大仁，行厚相若，其類在申。凡興利除害也，其類在漏甕。厚親不稱行而類行，其類在江上井。不為己之可譽也，其類在獵走。愛人非為譽也，其類在逆旅。愛人之親若愛其親，其類在官苟。兼愛相若，一愛相若，一愛相若，其類在死也。
en: Motse said: To make any statement or to publisli any doctrine, there must first be established some standard of judgment To discuss without a standard is like determining the directions of sunrise and sunset on a revolving potter’s wheel. Even skilful artisans could not get accurate results in that way. Xow that the truth and error (of a doctrine) in the world is hard to tell, there must be three tests. What are the three tests? They are the test of its basis, the test of its verifiability, and the test of its applicability. To test the basis of a doctrine we shall examine the will of Heaven and spirits and the deeds of the sage-kings. To test its verifiability we shall go to the books of the early kings. As to its applicability it is to be tested by its use in the administration of justice and government. These then are the three tests of a doctrine. Among the gentlemen of to-day some think there is fate, some think there is no fate. That I am able to judge whether there is fate or not is by the sense testimony of the multitude. If some have heard it and some have seen it I shall say there is fate. If none has heard it, if none has seen it, I shall say there is no fate. Why not then let us inquire into the sense testimony of the people? From antiquity to the present, since the beginning of man, has any seen such a thing as fate, or has heard the sound of fate? Of course, there is none. If the common people are considered stupid and their senses of hearing and sight unreliable, then why not inquire into til© recorded statements of the feudal lords? But from antiquity to the present, since the beginning of m has any of them heard the sound of fate or seen such a thing as fate? Of course, none of them has. Again, why not let us inquire into the deeds of the sage-kings? The ancient kings promoted the filial sons and encouraged them to continue to serve their parents, and respected the virtuous and gentle and encouraged them to continue to do good. They published their orders to instruct (the people), and made reward and pmiishment fair to encourage (the good) and obstruct (the evil). In this way confusion could be reduced to order and danger could be converted to peace. If anyone doubts this, let us recall; In ancient times the confusion of Chieh was reduced to order by T’ang, and that of Chow by King Wu. Now, the times did not change and the people did not alter. Yet when the superior changed a regime the subordinates modified their conduct. Under T’ang and Wu it was orderly, but under Chieh and Chow it was disorderly. Hence peace and danger, order and disorder, all depend on the government of the superior. How can it be said everything is according to fate? So, assertions about there being fate are quite false. The fatalists tell us: This doctrine has not been invented by us in a late generation. Such a doctrine has appeared and been handed down since the Three Dynasties. Why do you, sir, now oppose it? " (In answer,) Motse asked: Was it from the sages and good men of the Three Dynasties or from the wicked and the vicious of the Three Dynasties that the fatalistic doctrine came? How can we find this out? In the beginning secretaries and ministers were careful in speecli and intelligent in conduct. They could persuade their ruler above and instruct the people below. Thus they obtained reward from their ruler and applause from the people. And the fame of those secretaries and ministers has come down to the present day. The whole world remarks: " This is the result of endeavour." And it will never say; I see fate there." On the other hand, the wicked kings of the Three Dynasties did not control the lust of their ears and eyes and did not restrain the passions of their heart. When they went out they indulged in racing, hunting, and trapping. When they stayed indoors they revelled in wine and music. They did not attend to the government of the country and of the people, but they did much that was of no use. They oppressed the people, causing the subordinates not to love their superior. Hence the country became empty and without any future, and they themselves were in punishment and disaster. But they would not confess and say: I am stupid and insolent and poor in administering the government." But they would say: It is but my fate to perish." Even the miserable people of the Three Dynasties were like this. Within they could not well serve their parents, with-out they could not well serve their ruler. They disliked politeness and frugality but liked licence and ease. They indulged in drinking and eating and were lazy. The means of food and clothing became insufficient and they placed themselves in danger of hunger and cold. They would not confess: I am stupid and insolent and was not diligent at work." But they would say: It is but my fate to be poor." Such, then, also were the miserable people of the Three Dynasties. Fatalism has been glossed over and taught the stupid people. This was of great concern to the sage-kings, and they put it down on the bamboos and silk and cut it in metals and stone. Among the books of the kings, "The Announcement of Chung Hui" says: I have heard the man of Hsia issue orders, pretending them to be fate of Heaven. God was displeased and destroyed his forces." This shows how King Chieh of Hsia believed; in fate and how both T’ang and Chung Hui thought it to be ong. Among the books of early kings " The Great Declaration" says: 'Chow became insolent and would not worship God, and pushed away the ancestors and spirits without offering them sacrifices. And he said: ‘Fortune is with my people,’ and neglected and betrayed his duty. Heaven thereupon ‘.deserted him and withdrew its protection." This shows how Chow believed in fate and how King Wu proclaimed it to be wrong with " The Great Declaration Again, not come from Heaven, but is shaped by one’s self." And it is said in the odes and books of Shang and Hsia: Fate ■ is born of the TO | So, then, if the gentlemen of the world desire to distinguish right and wrong, benefit and harm, fate of Heaven must be strenuously discredited. To hold there is fate is the great disaster of the world. And therefore Motse refuted it.

source: 其利小人也，厚於小人之利大人也。
en: Even skilful artisans could not get accurate results in that way.

source: 以臧為其親也而愛之，愛其親也；以臧為其親也而利之，非利其親也。
en: Xow that the truth and error (of a doctrine) in the world is hard to tell, there must be three tests.

source: 以樂為利其子，而為其子欲之，愛其子也；以樂為利其子，而為其子求之，非求其子也。
en: What are the three tests? They are the test of its basis, the test of its verifiability, and the test of its applicability.

source: 於所體之中，而權輕重之謂權。權非為是也，亦非為非也。權，正也。斷指以存腕，利之中取大，害之中取小也。
en: To test the basis of a doctrine we shall examine the will of Heaven and spirits and the deeds of the sage-kings.

source: 害之中取小也，非取害也，取利也。其所取者，人之所執也。
en: To test its verifiability we shall go to the books of the early kings.

source: 遇盜人，而斷指以免身，利也；其遇盜人，害也。斷指與斷腕，利於天下相若，無擇也。死生利若，非無擇也。
en: As to its applicability it is to be tested by its use in the administration of justice and government.

source: 殺一人以存天下，非殺一人以利天下也。
en: These then are the three tests of a doctrine.

source: 殺己以存天下，是殺己以利天下。於事為之中，而權輕重之謂求。求，為之非也。
en: Among the gentlemen of to-day some think there is fate, some think there is no fate.

source: 害之中取小，求為義，非為義也。為暴人語天之為是也，而性，為暴人歌天之為非也。
en: That I am able to judge whether there is fate or not is by the sense testimony of the multitude.

source: 諸陳執既有所為，而我為之陳執，執之所為，因吾所為也；
en: If some have heard it and some have seen it I shall say there is fate.

source: 若陳執未有所為，而我為之陳執，陳執因吾所為也。暴人為我為天之以人非為是也，而性。
en: If none has heard it, if none has seen it, I shall say there is no fate.

source: 不可正而正之。利之中取大，非不得已也；害之中取小，不得已也。所未有而取焉，是利之中取大也；於所既有而棄焉，是害之中取小也。
en: Why not then let us inquire into the sense testimony of the people? From antiquity to the present, since the beginning of man, has any seen such a thing as fate, or has heard the sound of fate? Of course, there is none.

source: 義可厚，厚之；義可薄，薄之，謂倫列。德行、君上、老長、親戚，此皆所厚也。為長厚，不為幼薄。親厚，厚。親薄，薄。
en: If the common people are considered stupid and their senses of hearing and sight unreliable, then why not inquire into til© recorded statements of the feudal lords? But from antiquity to the present, since the beginning of m has any of them heard the sound of fate or seen such a thing as fate? Of course, none of them has.

source: 親至，薄不至。義，厚親不稱行而顧行。為天下厚禹，為禹厚也。為天下愛禹，乃為禹之愛人也。厚禹之加於天下，而厚禹不加於天下。若惡盜之為加於天下，而惡盜不加於天下。
en: Again, why not let us inquire into the deeds of the sage-kings? The ancient kings promoted the filial sons and encouraged them to continue to serve their parents, and respected the virtuous and gentle and encouraged them to continue to do good.

source: 愛人不外己，己在所愛之中。己在所愛，愛加於己。倫列之愛己，愛人也。聖人惡疾病，不惡危難。
en: They published their orders to instruct (the people), and made reward and pmiishment fair to encourage (the good) and obstruct (the evil).

source: 正體不動，欲人之利也，非惡人之害也。聖人不為其室，臧之故，在於臧。
en: In this way confusion could be reduced to order and danger could be converted to peace.

source: 聖人不得為子之事。聖人之法，死亡親，為天下也。厚親，分也，以死亡之，體渴興利。有厚薄而毋倫列，之興利為己。語經：
en: If anyone doubts this, let us recall; In ancient times the confusion of Chieh was reduced to order by T’ang, and that of Chow by King Wu.

source: 語經也，非白馬焉，執駒焉說求之，無說非也。殺犬之無大，非也。
en: Now, the times did not change and the people did not alter.

source: 三物必具，然後足以生。臧之愛己，非為愛己之人也。
en: Yet when the superior changed a regime the subordinates modified their conduct.

source: 厚不外己。愛無厚薄，譽己，非賢也。義，利，不義，害。志功為辯。
en: Under T’ang and Wu it was orderly, but under Chieh and Chow it was disorderly.

source: 有友於秦馬，有友於馬，也智來者之馬也。愛眾世與愛寡世相若。兼愛之有相若。愛尚世與愛後世，一若今之世人也。鬼，非人也，兄之鬼，兄也。天下之利驩。
en: Hence peace and danger, order and disorder, all depend on the government of the superior. How can it be said everything is according to fate? So, assertions about there being fate are quite false.

source: 聖人有愛而無利，俔日之言也，乃客之言也。天下無人，子墨子之言也。猶在。
en: The fatalists tell us: This doctrine has not been invented by us in a late generation.

source: 不得已而欲之，非欲之也，專殺臧。非殺臧也。專殺盜，非殺盜也。
en: Such a doctrine has appeared and been handed down since the Three Dynasties.

source: 小圜之圜，與大圜之圜同。不至尺之不至也，與不至千里之不至不異，其不至同者，遠近之謂也。是璜也，是玉也。意楹，非意木也，意是楹之木也。意指之人也，非意人也。意獲也，乃意禽也。
en: Why do you, sir, now oppose it? " (In answer,) Motse asked: Was it from the sages and good men of the Three Dynasties or from the wicked and the vicious of the Three Dynasties that the fatalistic doctrine came? How can we find this out? In the beginning secretaries and ministers were careful in speecli and intelligent in conduct.

source: 志功，不可以相從也。凡譽愛人，利人也，為其人也。
en: They could persuade their ruler above and instruct the people below.

source: 富人，非為其人也。有為也以富人。富人也，治人有為鬼焉。為賞譽利一人，非為賞譽利人也。亦不至無賞譽於人。
en: Thus they obtained reward from their ruler and applause from the people. And the fame of those secretaries and ministers has come down to the present day.

source: 智親之一利，未為孝也，亦不至於智不為己之利於親也。智是世之有盜也，盡愛是世。智是室之有盜也，不盡惡是室也。智其一人之盜也，不盡是二人。雖其一人之盜，苟不智其所在，盡惡其朋也。諸聖人所先為，人效名實。
en: The whole world remarks: " This is the result of endeavour." And it will never say; I see fate there." On the other hand, the wicked kings of the Three Dynasties did not control the lust of their ears and eyes and did not restrain the passions of their heart.

source: 實不必名。苟是石也白，敗是石也，盡與白同。是石也唯大，不與大同，是有使謂焉也。
en: When they went out they indulged in racing, hunting, and trapping. When they stayed indoors they revelled in wine and music.

source: 以形貌命者，必智是之某也，焉智某也。不可以形貌命者，唯不智是之某也，智某可也。
en: They did not attend to the government of the country and of the people, but they did much that was of no use.

source: 諸以居運命者，苟入於其中者，皆是也，去之，因非也。
en: They oppressed the people, causing the subordinates not to love their superior.

source: 諸以居運命者，若鄉里齊、荊者，皆是。諸以形貌命者，若山丘室廟者，皆是也。
en: Hence the country became empty and without any future, and they themselves were in punishment and disaster.

source: 智與意異。重同，俱同，連同，同類之同，同名之同，同根之同，丘同，鮒同，是之同，然之同。有非之異，有不然之異。有其異也，為其同也，為其同也異。
en: But they would not confess and say: I am stupid and insolent and poor in administering the government." But they would say: It is but my fate to perish." Even the miserable people of the Three Dynasties were like this.

source: 一曰乃是而然，二曰乃是而不然，三曰遷，四曰強。子深其深，淺其淺，益其益，尊其尊。
en: Within they could not well serve their parents, with-out they could not well serve their ruler.

source: 察次由比因至，優指得，次察聲端名，因情得。
en: They disliked politeness and frugality but liked licence and ease.

source: 匹夫辭惡者，人有以其請得焉。諸所遭執，而欲惡生者，人不必以其請得焉。聖人之拊瀆也，仁而無利愛，利愛生於慮。
en: They indulged in drinking and eating and were lazy. The means of food and clothing became insufficient and they placed themselves in danger of hunger and cold.

source: 昔者之慮也，非今日之慮也；昔者之愛人也，非今之愛人也。愛獲之愛人也，生於慮獲之利，慮獲之利，非慮臧之利也，而愛臧之愛人也，乃愛獲之愛人也。
en: They would not confess: I am stupid and insolent and was not diligent at work." But they would say: It is but my fate to be poor." Such, then, also were the miserable people of the Three Dynasties.

source: 去其愛而天下利，弗能去也。昔之知嗇，非今日之知嗇也。
en: Fatalism has been glossed over and taught the stupid people.

source: 貴為天子，其利人不厚於匹夫。二子事親，或遇孰，或遇凶，其親也相若。非彼其行益也，非加也。外埶無能厚吾利者。
en: This was of great concern to the sage-kings, and they put it down on the bamboos and silk and cut it in metals and stone.

source: 藉臧也死而天下害，吾持養臧也萬倍，吾愛臧也不加厚。長人之與短人也同，其貌同者也，故同。
en: Among the books of the kings, "The Announcement of Chung Hui" says: I have heard the man of Hsia issue orders, pretending them to be fate of Heaven.

source: 指之人也與首之人也異。人之體，非一貌者也，故異。戕劍與挺劍異，劍以形貌命者也，其形不一，故異。
en: God was displeased and destroyed his forces." This shows how King Chieh of Hsia believed; in fate and how both T’ang and Chung Hui thought it to be ong.

source: 楊木之木與桃木之木也，同。諸非以舉量數命者，取之盡是也。故一指，非一人也，一人之指，乃是一人也。
en: Among the books of early kings " The Great Declaration" says: 'Chow became insolent and would not worship God, and pushed away the ancestors and spirits without offering them sacrifices.

source: 方之一面，非方也，方木之面，方木也。夫辭以故生，以理長，以類行也者。
en: And he said: ‘Fortune is with my people,’ and neglected and betrayed his duty.

source: 立辭而不明於其所生，妄也。今人非道無所行，唯有強股肱，而不明於道，其困也，可立而待也。夫辭以類行者也，立辭而不明於其類，則必困矣。
en: Heaven thereupon ‘.deserted him and withdrew its protection." This shows how Chow believed in fate and how King Wu proclaimed it to be wrong with " The Great Declaration Again, not come from Heaven, but is shaped by one’s self." And it is said in the odes and books of Shang and Hsia: Fate ■ is born of the TO | So, then, if the gentlemen of the world desire to distinguish right and wrong, benefit and harm, fate of Heaven must be strenuously discredited. To hold there is fate is the great disaster of the world.

source: 故浸淫之辭，其類在鼓栗。聖人也，為天下也，其類在于追迷。
en: And therefore Motse refuted it.
